src/Documents/ЗаказНаРемонт/ЗаказНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаРемонт</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>InformationRegister.ПланРемонтов</registerRecords>
  <registerRecords>InformationRegister.РемонтыРабочихЦентров</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>InformationRegister.ПериодыАктуальностиОбъектовЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ТрудозатратыКОформлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВидРемонта</name>
    <type>
      <types>CatalogRef.ОбщиеВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтноеМероприятие</name>
    <type>
      <types>CatalogRef.РемонтныеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехРешение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныТрудозатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЗаказНаВнутреннееПотреблениеРабот</name>
    <comment>Технический признак того, что заказ формирует распоряжения на внутреннее потребление работ.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонты</name>
    <attributes>
      <name>Узел</name>
      <type>
        <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтныйЦикл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияЗарплаты</name>
      <type>
        <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗавершения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УстраняемыеДефекты</name>
    <attributes>
      <name>Дефект</name>
      <type>
        <types>DocumentRef.РегистрацияДефекта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>CatalogRef.Бригады</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/СтатусыЗаказовНаРемонт/СтатусыЗаказовНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовНаРемонт</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыОбъектовЭксплуатации/СтатусыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбъектовЭксплуатации</name>
  <enumValues>
    <name>ВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
  <enumValues>
    <name>Ликвидирован</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыДефектов/СтатусыДефектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДефектов</name>
  <enumValues>
    <name>Зарегистрирован</name>
    <comment>Внесена запись о дефекте. Черновик</comment>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Признан</name>
  </enumValues>
  <enumValues>
    <name>ОтложеноУстранение</name>
  </enumValues>
  <enumValues>
    <name>Устранен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РегистрацияДефекта/РегистрацияДефекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияДефекта</name>
  <registerRecords>InformationRegister.ПериодыАктуальностиОбъектовЭксплуатации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнееВремяУстранения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаказНаРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДефектныеУзлы</name>
    <attributes>
      <name>Узел</name>
      <type>
        <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаказНаРемонт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает статус для объекта документа
//
// Параметры:
// 		НовыйСтатус - Строка - Имя статуса, который будет установлен у документа
// 		ДополнительныеПараметры - Структура - Структура дополнительных параметров установки статуса.
//								Конструктор структуры: ЗаказыСервер.СтруктураКорректировкиСтрокЗаказа().
//
// Возвращаемое значение:
// 		Булево - Истина, в случае успешной установки нового статуса.
//
Функция УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаказовНаРемонт[НовыйСтатус];
	
	Если ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаказовНаРемонт.Выполняется Тогда
		ДатаНачалаФактическая = ТекущаяДатаСеанса();
	ИначеЕсли ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаказовНаРемонт.Закрыт Тогда
		ДатаЗавершенияФактическая = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		ЗаказыСервер.СкорректироватьСтрокиЗаказа(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	Статус = ЗначениеНовогоСтатуса;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаРемонт);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	
	Возврат ПроверитьЗаполнение();
	
КонецФункции // УстановитьСтатус()

// Корректирует строки, по которым не была оформлено списание или отгрузка или имеются расхождения по мерным товарам.
//
// Параметры:
// 		СтруктураПараметров - Структура - Структура параметров корректировки, конструктор: ЗаказыСервер.СтруктураКорректировкиСтрокЗаказа().
//
// Возвращаемое значение:
// 		Структура
// 		*	КоличествоСтрок - Количество отмененных/скорректированных строк.
//
Функция СкорректироватьСтрокиЗаказа(СтруктураПараметров) Экспорт
	
	Если Не СтруктураПараметров.ОтменитьНеотработанныеСтроки И Не СтруктураПараметров.СкорректироватьМерныеТовары Тогда
		Возврат ЗаказыСервер.РезультатОтменыНеотработанныхСтрок(Неопределено)
	КонецЕсли;
	
	КоличествоСкорректированныхСтрок = 0;
	
	КорректироватьМатериалы = (СтруктураПараметров.ОтменитьНеотработанныеСтроки Или СтруктураПараметров.СкорректироватьМерныеТовары)
		И (СтруктураПараметров.ИмяТабличнойЧасти = "Товары" Или СтруктураПараметров.ИмяТабличнойЧасти = "МатериалыИРаботы");
	КорректироватьТрудозатраты = СтруктураПараметров.ОтменитьНеотработанныеСтроки
		И (СтруктураПараметров.ИмяТабличнойЧасти = "Товары" Или СтруктураПараметров.ИмяТабличнойЧасти = "Трудозатраты");
	
	Если Не СтруктураПараметров.ПроверятьОстатки Тогда
		
		СвойстваОтмененнойСтроки = Новый Структура("Отменено, СтатусУказанияСерий", Истина, 0);
		
		Если КорректироватьМатериалы Тогда
			
			Для каждого СтрокаТовары Из МатериалыИРаботы Цикл
				Если Не СтрокаТовары.Отменено Тогда
					
					ЗаполнитьЗначенияСвойств(СтрокаТовары, СвойстваОтмененнойСтроки);
					КоличествоСкорректированныхСтрок = КоличествоСкорректированныхСтрок + 1;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если КорректироватьТрудозатраты Тогда
			
			Для каждого СтрокаТовары Из Трудозатраты Цикл
				Если Не СтрокаТовары.Отменено Тогда
					
					ЗаполнитьЗначенияСвойств(СтрокаТовары, СвойстваОтмененнойСтроки);
					КоличествоСкорректированныхСтрок = КоличествоСкорректированныхСтрок + 1;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат ЗаказыСервер.РезультатОтменыНеотработанныхСтрок(КоличествоСкорректированныхСтрок);
	КонецЕсли;
	
	Если КорректироватьМатериалы Тогда
		
		ПараметрыЗаполнения = ЗаказыСервер.ПараметрыЗаполненияДляОтменыСтрок();
		ПараметрыЗаполнения.МенеджерРегистра  = РегистрыНакопления.ЗаказыНаВнутреннееПотребление;
		ПараметрыЗаполнения.ИмяТабличнойЧасти = "МатериалыИРаботы";
		ПараметрыЗаполнения.ПутиКДанным.Вставить("Назначение", "Назначение");
		
		ПараметрыОтмены = ЗаказыСервер.ПараметрыОтменыСтрокЗаказов();
		ПараметрыОтмены.ОтменятьТолькоМерныеТовары = НЕ СтруктураПараметров.ОтменитьНеотработанныеСтроки
			И СтруктураПараметров.СкорректироватьМерныеТовары;
		ПараметрыОтмены.СкорректироватьМерныеТовары = СтруктураПараметров.СкорректироватьМерныеТовары;
		
		КоличествоСкорректированныхСтрок = КоличествоСкорректированныхСтрок
			+ ЗаказыСервер.ОтменитьНеотработанныеСтрокиПоОтгрузке(ЭтотОбъект, ПараметрыЗаполнения, ПараметрыОтмены).КоличествоСтрок;
		
		ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаРемонт));
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
		
	КонецЕсли;
	
	Если КорректироватьТрудозатраты Тогда
		
		КоличествоСкорректированныхСтрок = КоличествоСкорректированныхСтрок
			+ Документы.ЗаказНаРемонт.ОтменитьНевыполненныеСтрокиТрудозатрат(ЭтотОбъект, Истина);
		
	КонецЕсли;
	
	Возврат ЗаказыСервер.РезультатОтменыНеотработанныхСтрок(КоличествоСкорректированныхСтрок);
	
КонецФункции

// Проверяет правильность заполнения ключей ремонтов в табличной части
//
// Параметры:
// 		ТабличнаяЧасть - ТабличнаяЧасть - Табличная часть объекта документа.
//
Процедура СопоставитьКлючиРемонтовВТабличнойЧасти(ТабличнаяЧасть) Экспорт
	
	СоответствиеРемонтов = Неопределено;
	
	Если Не ДополнительныеСвойства.Свойство("СоответствиеРемонтов", СоответствиеРемонтов)
		Или СоответствиеРемонтов = Неопределено Тогда
		
		СоответствиеРемонтов = Новый Соответствие;
		Для Каждого Ремонт Из Ремонты Цикл
			СоответствиеРемонтов.Вставить(Ремонт.КодРемонта, Истина);
		КонецЦикла;
		ДополнительныеСвойства.Вставить("СоответствиеРемонтов", СоответствиеРемонтов);
		
	КонецЕсли;
	
	СтруктураНеСопоставленногоРемонта = Новый Структура("КодРемонта", 0);
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Если ЗначениеЗаполнено(Строка.КодРемонта) И СоответствиеРемонтов.Получить(Строка.КодРемонта)=Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Строка, СтруктураНеСопоставленногоРемонта);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.СтатусыЗаказовНаРемонт.Создан;
	МаксимальныйКодСтрокиНоменклатуры = 0;
	МаксимальныйКодСтрокиТрудозатрат = 0;
	Назначение = Неопределено;
	
	Для каждого СтрокаТовары Из МатериалыИРаботы Цикл
		
		СтрокаТовары.Отменено = Ложь;
		СтрокаТовары.КодСтроки = 0;
		
	КонецЦикла;
	
	Для каждого СтрокаТовары Из Трудозатраты Цикл
		
		СтрокаТовары.КодСтроки = 0;
		
	КонецЦикла;
	
	ДоступныТрудозатраты = Ложь;
	Трудозатраты.Очистить();
	
	ПараметрыЗаполнения = Документы.ЗаказНаРемонт.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ПотреблениеДляДеятельности, ПараметрыЗаполнения);
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ОбъектыЭксплуатации")
		Или ТипДанныхЗаполнения = Тип("СправочникСсылка.УзлыОбъектовЭксплуатации") Тогда
			
		ЗаполнитьДокументНаОснованииОбъектаЭксплуатации(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РегистрацияДефекта") Тогда
		
		ЗаполнитьДокументНаОснованииРегистрацииДефекта(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ЗаказНаРемонт.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ПотреблениеДляДеятельности, ПараметрыЗаполнения);
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	УстановитьКлючиВСтрокахТабличнойЧасти(Ремонты, "КодРемонта", МаксимальныйКодРемонта);
	УстановитьКлючиВСтрокахТабличнойЧасти(МатериалыИРаботы, "КодСтроки", МаксимальныйКодСтрокиНоменклатуры);
	УстановитьКлючиВСтрокахТабличнойЧасти(Трудозатраты, "КодСтроки", МаксимальныйКодСтрокиТрудозатрат);
	
	СопоставитьКлючиРемонтовВТабличнойЧасти(МатериалыИРаботы);
	СопоставитьКлючиРемонтовВТабличнойЧасти(Трудозатраты);
	
	ПараметрыОкругления = НоменклатураСервер.ПараметрыОкругленияКоличестваШтучныхТоваров();
	ПараметрыОкругления.ИмяТЧ = "МатериалыИРаботы";
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления);
	
	ШаблонНазначения = Документы.ЗаказНаРемонт.ШаблонНазначения(ЭтотОбъект);
	Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(Назначение, ШаблонНазначения, ЭтотОбъект, "НаправлениеДеятельности", Отказ);
	
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект,
		НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаРемонт));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	ШаблонНазначения = Документы.ЗаказНаРемонт.ШаблонНазначения(ЭтотОбъект);
	Справочники.Назначения.ПриЗаписиДокумента(Назначение, ШаблонНазначения, ЭтотОбъект, Подразделение, ПотреблениеДляДеятельности);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ВыполнитьКонтрольЗаказаПослеПроведения(Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;
	
	ПроверяемыеРеквизиты.Добавить("Ремонты");
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("МатериалыИРаботы.Склад");
	
	Документы.ЗаказНаРемонт.ИменаРеквизитовПоХозяйственнойОперации(
		ХозяйственнаяОперация, 
		МассивВсехРеквизитов, 
		МассивРеквизитовОперации);
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитовОперации,
		МассивНепроверяемыхРеквизитов);
	
	Если Статус = Перечисления.СтатусыЗаказовНаРемонт.Создан Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаЗавершения");
	КонецЕсли;

	Если Статус = Перечисления.СтатусыЗаказовНаРемонт.Выполняется Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаЗавершенияФактическая");
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаказовНаРемонт.Создан
		Или Статус = Перечисления.СтатусыЗаказовНаРемонт.КВыполнению Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаФактическая");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаЗавершенияФактическая");
		
		МассивНепроверяемыхРеквизитов.Добавить("Трудозатраты.Бригада");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаЗавершения)
		И ДатаНачала > ДатаЗавершения Тогда
		
		ТекстОшибки = НСтр("ru = 'Плановая дата завершения работ %ДатаЗавершения% должна быть не меньше плановой даты начала %ДатаНачала%';
							|en = 'Planned end date %ДатаЗавершения% of repair activities must be on or after planned start date %ДатаНачала%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаНачала%", Формат(ДатаНачала, "ДЛФ=DD"));
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаЗавершения%", Формат(ДатаЗавершения, "ДЛФ=DD"));
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаЗавершения",
			,
			Отказ);
		
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыЗаказовНаРемонт.Закрыт
		И ЗначениеЗаполнено(ДатаНачалаФактическая) И ЗначениеЗаполнено(ДатаЗавершенияФактическая)
		И ДатаНачалаФактическая > ДатаЗавершенияФактическая Тогда
		
		ТекстОшибки = НСтр("ru = 'Фактическая дата завершения работ %ДатаЗавершения% должна быть не меньше фактической даты начала %ДатаНачала%';
							|en = 'Actual work finish date %ДатаЗавершения% must be on or after actual start date %ДатаНачала%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаНачала%", Формат(ДатаНачалаФактическая, "ДЛФ=DD"));
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаЗавершения%", Формат(ДатаЗавершенияФактическая, "ДЛФ=DD"));
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаЗавершенияФактическая",
			,
			Отказ);
		
	КонецЕсли;
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ИмяТЧ = "МатериалыИРаботы";
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
	ПараметрыПроверки.ИмяТЧ = "МатериалыИРаботы";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки);
	
	ПроверитьЗаполнениеРемонтов(Отказ);
	ПроверитьЗаполнениеМатериаловИРабот(Отказ);
	ПроверитьЗаполнениеРабочихЦентров(Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
												НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаРемонт),
												Отказ,
												МассивНепроверяемыхРеквизитов);
	
	ПараметрыПроверки = Документы.ЗаказНаРемонт.ПараметрыПроверкиЗаполненияДокументаПоВидуДеятельностиНДС(ЭтотОбъект);
	УчетНДСУП.ПроверитьЗаполнениеДокументаПоВидуДеятельностиНДС(ЭтотОбъект, ПотреблениеДляДеятельности, ПараметрыПроверки, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет документ в соответствии с отбором
//
Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Заполняет документ на основании ссылки на справочник объектов эксплуатации
//
Процедура ЗаполнитьДокументНаОснованииОбъектаЭксплуатации(Знач Основание)
	
	Ремонты.Очистить();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОбъектыЭксплуатации.Ссылка КАК ОбъектЭксплуатации,
		|	ОбъектыЭксплуатации.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА ОбъектыЭксплуатации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовЭксплуатации.ВЭксплуатации)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	ОбъектыЭксплуатации.ПометкаУдаления КАК ЕстьОшибкиУдален,
		|	ОбъектыЭксплуатации.ЭтоГруппа КАК ЕстьОшибкиГруппа,
		|	ЕСТЬNULL(Узлы.РемонтирующееПодразделение, ОбъектыЭксплуатации.РемонтирующееПодразделение) КАК Подразделение
		|ИЗ
		|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УзлыОбъектовЭксплуатации КАК Узлы
		|		ПО Узлы.Ссылка = &Ссылка
		|ГДЕ
		|	(ОбъектыЭксплуатации.Ссылка = &Ссылка
		|			ИЛИ ОбъектыЭксплуатации.Ссылка В
		|				(ВЫБРАТЬ
		|					Узлы.Владелец
		|				ИЗ
		|					Справочник.УзлыОбъектовЭксплуатации КАК Узлы
		|				ГДЕ
		|					Узлы.Ссылка = &Ссылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Узлы.Ссылка КАК Узел,
		|	Узлы.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА Узлы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовЭксплуатации.ВЭксплуатации)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	Узлы.ПометкаУдаления КАК ЕстьОшибкиУдален
		|ИЗ
		|	Справочник.УзлыОбъектовЭксплуатации КАК Узлы
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Узлы.Ссылка = &Ссылка
		|				ТОГДА ИСТИНА
		|			КОГДА Узлы.Владелец = &Ссылка
		|				ТОГДА Узлы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовЭксплуатации.ВЭксплуатации)
		|						И НЕ Узлы.ПометкаУдаления
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Ссылка", Основание);
	
	ТекстОшибкиГруппа = НСтр("ru = 'Элемент справочника ""%1"" является группой. Ввод на основании групп справочника запрещен.';
							|en = '""%1"" is a group. Cannot generate documents from a group.'");
	ТекстОшибкиУдален = НСтр("ru = '%1 ""%2"" помечен на удаление. Ввод на основании помеченного на удаление элемента справочника запрещен.';
							|en = '%1 ""%2"" is marked for deletion. Cannot generate documents from items that have been marked for deletion.'");
	ТекстОшибкиСтатус = НСтр("ru = '%1 ""%2"" находится в статусе ""%3"". Ввод на основании разрешен только в статусе ""В эксплуатации"".';
							|en = '%1 ""%2"" in ""%3"" status. To generate a document, change its status to ""Operating"".'");
	
	Пакет = Запрос.ВыполнитьПакет();
	Если Не Пакет[0].Пустой() Тогда
		
		Выборка = Пакет[0].Выбрать();
		Выборка.Следующий();
		
		Если Выборка.ЕстьОшибкиГруппа Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибкиГруппа,
				Выборка.ОбъектЭксплуатации);
			ВызватьИсключение ТекстОшибки;
		ИначеЕсли Выборка.ЕстьОшибкиУдален Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибкиУдален,
				НСтр("ru = 'Объект эксплуатации';
					|en = 'Asset'"),
				Выборка.ОбъектЭксплуатации);
			ВызватьИсключение ТекстОшибки;
		ИначеЕсли Выборка.ЕстьОшибкиСтатус Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибкиСтатус,
				НСтр("ru = 'Объект эксплуатации';
					|en = 'Asset'"),
				Выборка.ОбъектЭксплуатации,
				Выборка.Статус);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		ОбъектЭксплуатации = Выборка.ОбъектЭксплуатации;
		Подразделение = Выборка.Подразделение;
		
	КонецЕсли;
	
	Если Не Пакет[1].Пустой() Тогда
		Выборка = Пакет[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ЕстьОшибкиУдален Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстОшибкиУдален,
					НСтр("ru = 'Узел объекта эксплуатации';
						|en = 'Sub-asset'"),
					Выборка.Узел);
				ВызватьИсключение ТекстОшибки;
			ИначеЕсли Выборка.ЕстьОшибкиСтатус Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстОшибкиСтатус,
					НСтр("ru = 'Узел объекта эксплуатации';
						|en = 'Sub-asset'"),
					Выборка.Узел,
					Выборка.Статус);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			ЭтотОбъект.Ремонты.Добавить().Узел = Выборка.Узел;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет документ на основании зарегистрированного дефекта
//
Процедура ЗаполнитьДокументНаОснованииРегистрацииДефекта(Знач Основание)
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыДефектов.Зарегистрирован);
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыДефектов.ОтложеноУстранение);
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыДефектов.Признан);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РегистрацияДефекта.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
		|	РегистрацияДефекта.ОбъектЭксплуатации.РемонтирующееПодразделение КАК Подразделение,
		|	РегистрацияДефекта.Решение КАК ТехРешение,
		|	РегистрацияДефекта.Ссылка КАК Дефект,
		|	НЕ РегистрацияДефекта.Проведен КАК ЕстьОшибкиПроведен,
		|	ВЫБОР
		|		КОГДА РегистрацияДефекта.Статус В (&МассивДопустимыхСтатусов)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	РегистрацияДефекта.Статус КАК СтатусДокумента,
		|	РегистрацияДефекта.ТребуетсяЗаказНаРемонт КАК ТребуетсяЗаказНаРемонт
		|ИЗ
		|	Документ.РегистрацияДефекта КАК РегистрацияДефекта
		|ГДЕ
		|	РегистрацияДефекта.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Узлы.Узел КАК Узел
		|ИЗ
		|	Документ.РегистрацияДефекта.ДефектныеУзлы КАК Узлы
		|ГДЕ
		|	Узлы.Ссылка = &Основание
		|
		|УПОРЯДОЧИТЬ ПО
		|	Узлы.НомерСтроки");
	
	Запрос.УстановитьПараметр("МассивДопустимыхСтатусов", МассивДопустимыхСтатусов);
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Если Не Пакет[0].Пустой() Тогда
		
		Таблица = Пакет[0].Выгрузить();
		Реквизиты = Таблица[0];
		
		ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
			Реквизиты.Дефект,
			Реквизиты.СтатусДокумента,
			Реквизиты.ЕстьОшибкиПроведен,
			Реквизиты.ЕстьОшибкиСтатус,
			МассивДопустимыхСтатусов);
		
		Если Не Реквизиты.ТребуетсяЗаказНаРемонт Тогда
			ТекстОшибки = НСтр("ru = 'Для документа %Документ% указан способ устранения ""Устраняется на месте"".
			|Ввод на основании разрешен только для способа устранения ""Требуется ремонт"".';
			|en = 'The ""Eliminated on site"" elimination method is specified for the %Документ% document.
			|Input on basis is only allowed for the ""R&M is required"" elimination method.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", Основание);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты, "ОбъектЭксплуатации, ТехРешение, Подразделение");
		УстраняемыеДефекты.Загрузить(Таблица);
		
	КонецЕсли;
	
	Если Не Пакет[1].Пустой() Тогда
		Ремонты.Загрузить(Пакет[1].Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

// Инициализирует ремонтное задание
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Автор = Пользователи.ТекущийПользователь();
	
	ЭтоЗаказНаВнутреннееПотреблениеРабот = Истина;
	
	Если Не ЗначениеЗаполнено(НаименованиеРабот) Тогда
		НаименованиеРабот = НСтр("ru = 'Ремонт';
								|en = 'R&M'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = Дата;
	КонецЕсли;
	
	ОбеспечениеВДокументахСервер.ЗаполнитьВариантОбеспеченияПоУмолчанию(МатериалыИРаботы);
	Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Приоритет);
	
КонецПроцедуры

// Заполняет ключи строк для указаной табличной части
//
Процедура УстановитьКлючиВСтрокахТабличнойЧасти(ТабличнаяЧасть, ИмяКлюча, ТекущийМаксимальныйКлюч)
	
	СтрокиБезКлюча = ТабличнаяЧасть.НайтиСтроки(Новый Структура(ИмяКлюча, 0));
	Если СтрокиБезКлюча.Количество() > 0 Тогда
		
		Для Каждого СтрокаТовары Из СтрокиБезКлюча Цикл
			
			ТекущийМаксимальныйКлюч = ТекущийМаксимальныйКлюч + 1;
			СтрокаТовары[ИмяКлюча] = ТекущийМаксимальныйКлюч;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения табличной части "Ремонты"
//
Процедура ПроверитьЗаполнениеРемонтов(Отказ) 
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДанныеТабличнойЧасти.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(ДанныеТабличнойЧасти.Узел КАК Справочник.УзлыОбъектовЭксплуатации) КАК Узел,
		|	ВЫРАЗИТЬ(ДанныеТабличнойЧасти.ВидРемонта КАК Справочник.ВидыРемонтов) КАК ВидРемонта
		|ПОМЕСТИТЬ ДанныеТабличнойЧасти
		|ИЗ
		|	&ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеТабличнойЧасти1.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти2
		|		ПО ДанныеТабличнойЧасти1.Узел = ДанныеТабличнойЧасти2.Узел
		|			И ДанныеТабличнойЧасти1.ВидРемонта = ДанныеТабличнойЧасти2.ВидРемонта
		|			И ДанныеТабличнойЧасти1.НомерСтроки <> ДанныеТабличнойЧасти2.НомерСтроки");
	
	ТаблицаРемонтов = ЭтотОбъект.Ремонты.Выгрузить();
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУзлыОбъектовЭксплуатации") Тогда
		ТаблицаРемонтов.ЗаполнитьЗначения(Справочники.УзлыОбъектовЭксплуатации.ПустаяСсылка(), "Узел");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДанныеТабличнойЧасти", ТаблицаРемонтов);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ШаблонОшибки = НСтр("ru = 'Ремонт ""%ВидРемонта%"" для ""%ОбъектИлиУзел%"" в строке %НомерСтроки% повторяется в других строках табличной части';
						|en = 'R&M activity ""%ВидРемонта%"" of ""%ОбъектИлиУзел%"" in row %НомерСтроки% is duplicated in other rows'");
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаРемонта = ТаблицаРемонтов[Выборка.НомерСтроки - 1];
		ТекстОшибки = СтрЗаменить(ШаблонОшибки, "%ВидРемонта%", ?(ЗначениеЗаполнено(СтрокаРемонта.ВидРемонта), СтрокаРемонта.ВидРемонта, НСтр("ru = '<произвольный ремонт>';
																																				|en = '<any R&M>'")));
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОбъектИлиУзел%", ?(ЗначениеЗаполнено(СтрокаРемонта.Узел), СтрокаРемонта.Узел, ЭтотОбъект.ОбъектЭксплуатации));
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", Выборка.НомерСтроки);
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Ремонты", Выборка.НомерСтроки, "НомерСтроки"),,
			Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет правильность заполнения табличной части "Материалы и работы"
//
Процедура ПроверитьЗаполнениеМатериаловИРабот(Отказ)
	
	ПараметрыВстраивания = Документы.ЗаказНаРемонт.ДоступныеОстаткиПараметрыВстраивания();
	ТаблицаОшибок = ОбеспечениеВДокументахСервер.ТаблицаОшибокЗаполнения(ЭтотОбъект, ПараметрыВстраивания);
	
	ШаблонТекста = НСтр("ru = 'Не заполнена колонка ""Склад"" в строке %НомерСтроки% списка ""Материалы и работы""';
						|en = 'The ""Warehouse"" column in line %НомерСтроки% of the ""Materials and works"" list is not filled in'");
	
	Для ТекИндекс = 0 По ТаблицаОшибок.Количество() - 1 Цикл
		
		СтрокаОшибки = ТаблицаОшибок[ТекИндекс];
		
		Если СтрокаОшибки.СкладОбязателен И СтрокаОшибки.СкладНеЗаполнен Тогда
			
			ТекстОшибки   = СтрЗаменить(ШаблонТекста, "%НомерСтроки%", СтрокаОшибки.НомерСтроки);
			ПутьКТабЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("МатериалыИРаботы", СтрокаОшибки.НомерСтроки, "Склад");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКТабЧасти, , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет правильность заполнения табличной части "Рабочие центры" переданного объекта документа.
//
Процедура ПроверитьЗаполнениеРабочихЦентров(Отказ)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДанныеТабличнойЧасти.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
		|	ДанныеТабличнойЧасти.РабочийЦентр КАК РабочийЦентр,
		|	ВЫРАЗИТЬ(ДанныеТабличнойЧасти.ДатаНачала КАК ДАТА) КАК ДатаНачала,
		|	ВЫРАЗИТЬ(ДанныеТабличнойЧасти.ДатаЗавершения КАК ДАТА) КАК ДатаЗавершения
		|ПОМЕСТИТЬ ДанныеТабличнойЧасти
		|ИЗ
		|	&ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеТабличнойЧасти1.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТабличнойЧасти КАК ДанныеТабличнойЧасти2
		|		ПО ДанныеТабличнойЧасти1.РабочийЦентр = ДанныеТабличнойЧасти2.РабочийЦентр
		|			И ДанныеТабличнойЧасти1.НомерСтроки <> ДанныеТабличнойЧасти2.НомерСтроки
		|			И (ДанныеТабличнойЧасти1.ДатаНачала <= ДанныеТабличнойЧасти2.ДатаНачала
		|					И ДанныеТабличнойЧасти1.ДатаЗавершения > ДанныеТабличнойЧасти2.ДатаНачала
		|				ИЛИ ДанныеТабличнойЧасти1.ДатаНачала < ДанныеТабличнойЧасти2.ДатаЗавершения
		|					И ДанныеТабличнойЧасти1.ДатаЗавершения >= ДанныеТабличнойЧасти2.ДатаЗавершения)");
	
	Запрос.УстановитьПараметр("ДанныеТабличнойЧасти", ЭтотОбъект.РабочиеЦентры.Выгрузить());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ШаблонОшибки = НСтр("ru = 'Интервал остановки рабочего центра ""%РЦ%"" в строке %НомерСтроки% пересекается с другими строками табличной части';
						|en = 'Work center ""%РЦ%"" idle time interval in row %НомерСтроки% overlaps with other intervals in the table'");
	
	Пока Выборка.Следующий() Цикл
		
		Строка = ЭтотОбъект.РабочиеЦентры[Выборка.НомерСтроки - 1];
		ТекстОшибки = СтрЗаменить(ШаблонОшибки, "%РЦ%", Строка.РабочийЦентр);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", Выборка.НомерСтроки);
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РабочиеЦентры", Выборка.НомерСтроки, "ДатаНачала"),,
			Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольЗаказаПослеПроведения(Отказ)

	Если Статус = Перечисления.СтатусыЗаказовНаРемонт.Закрыт Тогда
		Массив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка);
		ДополнительныеПараметры = Новый Структура("КонтрольВыполненияЗаказа", Истина);
		
		Запрос = Документы.ЗаказНаРемонт.СформироватьЗапросПроверкиПриСменеСтатуса(Массив, "Закрыт", ДополнительныеПараметры);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаОтгрузка = Результат.Выбрать();
		
		ШаблонСообщения = НСтр("ru = 'У документа %Документ% не может быть установлен статус ""%Статус%"", т.к. заказ выполен не полностью';
								|en = 'The %Документ% document cannot have the ""%Статус%"" status as the order was fulfilled incompletely'");
		
		Пока ВыборкаОтгрузка.Следующий() Цикл
			
			ПроверкаПройдена = Документы.ЗаказНаРемонт.ПроверкаПередСменойСтатуса(
									ВыборкаОтгрузка, 
									Статус, 
									ДополнительныеПараметры, 
									ШаблонСообщения); 
									
			Если Не ПроверкаПройдена Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
